Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: In this example, note the difference in the result of using mapValues and compactMapValues with a transformation that returns an optional Int value.
ja: この例において、mapValuesとcompactMapValuesを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, the case 3 expression uses this pattern-matching operator to test whether weekday is equal to the value 3.
ja: この例では、case 3式はこのパターンマッチング演算子を使ってweekdayが値3と等しいかどうかテストします。

source: In this example, the colors array can be bridged to NSArray because the colors array’s String elements bridge to NSString.
ja: この例では、colors配列はNSArrayにブリッジできます、なぜならそれのcolors配列のもつString要素がNSStringにブリッジするからです。

source: In this example, the assignment to the twasBrillig constant calls this Boolean literal initializer behind the scenes.
ja: この例において、twasBrillig定数への代入は、このブールリテラルイニシャライザを舞台裏で呼びます。

source: In this example, the assignment to the x constant calls this floating-point literal initializer behind the scenes.
ja: この例において、x定数への代入は、この浮動小数点リテラルイニシャライザを舞台裏で呼びます。

source: In this example, the assignment to the x constant calls this integer literal initializer behind the scenes.
ja: この例において、x定数への代入は、この整数リテラルイニシャライザを舞台裏で呼びます。

source: In this example, the compiler infers the full type of each array literal.
ja: この例では、コンパイラは各配列の完全な型を推論します。

source: In this example, the resulting array is the same length as words:
ja: この例において、結果の配列はwordsと同じ長さです：

source: In this example, three elements in the middle of an array of integers are replaced by the five elements of a Repeated<Int> instance.
ja: この例では、整数からなる配列の真ん中の３つの要素が、Repeated<Int>インスタンスの５つの要素によって置き換えられます。

source: In your hash(into:) implementation, call combine(_:) on the provided Hasher instance with the essential components of your type.
ja: あなたのhash(into:)実装において、combine(_:)をその提供されたHasherインスタンス上で、あなたの型の本質的な構成要素とともに呼び出してください。

source: In your Objective-C bridging header, import every Objective-C header you want to expose to Swift.
ja: あなたのObjective-Cブリッジヘッダにおいて、あなたが露出したいあらゆるObjective-CヘッダをSwiftにインポートしてください。

source: Include Swift Classes in Objective-C Headers Using Forward Declarations
ja: SwiftクラスをObjective-Cヘッダの中に前方宣言を使ってインクルードする

source: Including More Data in Errors
ja: さらなるデータをエラーに含める

source: Indicates that a precondition was violated.
ja: これは前提条件が破られたことを指し示します。

source: Indicates that an internal sanity check failed.
ja: これはある内部的な正常性確認が失敗したことを指し示します。

source: Indication of the type of termination informed to onTermination.
ja: onTerminationに告知した終了の型を指し示すもの。

source: Indication that the continuation was yielded when the stream was already in a terminal state: either by cancel or by finishing.
ja: ストリームが既に終端状態であった時に継続が生み出されたというしるし；取り消しによってまたは終了によってのどちらか。

source: Indices and Iterators
ja: インデックスとイテレータ

source: Indices that are moved forward and backward in a bidirectional collection move by the same amount in each direction.
ja: 二方向性のコレクションにおいて前方および後方に移動されるインデックス値は、各方向で同じ量だけ移動します。

source: Inequality is the inverse of equality.
ja: 不等性は、同等性の裏返しです。

source: Infinite values with the same sign are equal to each other.
ja: 同じ符号を持つ無限大値は互いに等しいです。

source: Infinity
ja: 無限大

source: Infinity compares greater than all finite numbers and equal to other infinite values.
ja: 無限大は、すべての有限の数より大きい、そして他の無限大の値と等しいと比較されます

source: Information about an error condition including a domain, a domain-specific error code, and application-specific information.
ja: ある領域、ある領域特有のエラーコード、そしてアプリケーション特有の情報を含んでいるエラー条件についての情報。

source: Infrequently Used Functionality
ja: 滅多に使われない機能性

source: Infrequently Used Intializers
ja: 滅多に使われないイニシャライザ

source: Inherited By
ja: 継承される先

source: Inherits From
ja: 継承元

source: Initialization with Literals
ja: リテラルを使った初期化

source: Initializers
ja: イニシャライザ

source: Input and Output
ja: 入力と出力

source: Inserts a new element at the specified position.
ja: ある新しい要素を指定された位置で挿入します。

source: Inserts the elements of a sequence into the collection at the specified position.
ja: あるシーケンスに属する複数の要素をコレクションへ指定された位置で挿入します。

source: Inside the closure, set the initializedCount parameter to the number of elements that are initialized by the closure.
ja: クロージャ内部で、initializedCountパラメータを、クロージャによって初期化される要素の数に設定してください。

source: Inside unit test targets, you can access imported internal declarations as if they were public by prepending @testable to the product module import statement.
ja: ユニットテスト内部で、あなたはインポートされたinternal宣言に、まるでそれらがパブリックだったかのようにアクセスすることが、製品モジュールインポート文に@testableを前に付けることによって可能です。

source: Inspecting a Boolean
ja: ブールを調査する

source: Inspecting a Character
ja: 表意文字を調べる

source: Inspecting a Dictionary
ja: 辞書を調査する

source: Inspecting a Range
ja: 範囲を調査する

source: Inspecting an Array
ja: 配列を調査する

source: Instance Casting
ja: インスタンスのキャスト

source: Instance Method
ja: インスタンスメソッド

source: Instance Methods
ja: インスタンスメソッド

source: Instance Properties
ja: 様々なインスタンスプロパティ

source: Instance Property
ja: インスタンスプロパティ

source: Instead of calling this initializer, most code calls the withCheckedContinuation(function:_:) or withCheckedThrowingContinuation(function:_:) function instead.
ja: このイニシャライザを呼びださずに、ほとんどのコードはwithCheckedContinuation(function:_:)またはwithCheckedThrowingContinuation(function:_:)関数を代わりに呼び出します。

source: Instead of copying over the elements of a slice to new storage, an ArraySlice instance presents a view onto the storage of a larger array.
ja: ある断片部分（スライス）の要素をすっかり新しいストレージにコピーする代わりに、ArraySliceインスタンスはある大きな配列に関するある見方（ビュー）を提示します。

source: Instead of having constant time when averaged over many calls, the function may decay to performance that is linear in values.count.
ja: 多くの呼出しの全体を平均したとき定数時を持つのではなく、values.countにおいて線形である性能を関数が衰えさせるかもしれません。

source: Instead of returning an iterator with a type that encapsulates the implementation of the collection, the digits() function first wraps the iterator in an AnyIterator instance.
ja: このコレクションの実装をカプセル化するある型をもつイテレータを返すのではなく、digits()関数はイテレータをAnyIteratorインスタンスの中にまずラップします。

source: Instead of trapping on out-of-range values, using the failable init?(exactly:) initializer results in nil.
ja: 範囲外の値に関してトラップするのではなく、失敗できるinit?(exactly:)イニシャライザはnilという結果になります。

source: Instead, convert an instance of any type to a string by using the String(describing:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(describing:)イニシャライザを使って変換してください。

source: Instead, convert an instance of any type to a string by using the String(reflecting:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(reflecting:)イニシャライザを使って変換してください。

source: Instead, create a new Bool instance by using one of the Boolean literals true or false.
ja: 代わりに、新しいBoolインスタンスをブールリテラルのtrueまたはfalseのうち１つを使って作成してください。

source: Instead, create a new array by using an array literal as its value.
ja: 代わりに、配列リテラルをその値として使うことで新しい配列を作成してください。

source: Instead, each presents a view onto the storage of the absences array.
ja: 代わりに、absences配列のストレージ上でのひとつのビューをそれぞれが提示します。

source: Instead, initialize a variable or constant using a floating-point literal.
ja: 代わりに、浮動小数点リテラルを使って変数や定数を初期化してください。

source: Instead, initialize a variable or constant using an integer literal.
ja: 代わりに、整数リテラルを使って変数や定数を初期化してください。

source: Instead, initialize a variable or constant using one of the Boolean literals true and false.
ja: 代わりに、変数や定数をブールリテラルtrueとfalseのうちの１つを使って初期化してください。

source: Instead, use only the UnsafeMutableBufferPointer argument to body.
ja: その代わりに、UnsafeMutableBufferPointer引数だけをbodyに使ってください。

source: Instead, use only the UnsafeMutableRawBufferPointer argument to body.
ja: その代わりに、UnsafeMutableRawBufferPointer引数だけをbodyに使ってください。

source: Instead, use string interpolation to create a new string by including values, literals, variables, or expressions enclosed in parentheses, prefixed by a backslash (\(…)).
ja: 代わりに、文字列補間を使って、バックスラッシュ\(…)を前に置いた丸括弧に囲まれた値、リテラル、変数、または式を含めることで、新しい文字列を作成してください。

source: Instead, use the task property of UnsafeCurrentTask to access an instance of Task that you can store long-term and interact with outside of the closure body.
ja: 代わりに、UnsafeCurrentTaskのtaskプロパティを使うことで、あなたが長期間格納することそしてクロージャ本体の外側で相互作用することが可能なTaskのインスタンスにアクセスしてください。

source: Instead, use the Boolean literal false to create a new Bool instance.
ja: 代わりに、ブールリテラルfalseを使って新しいBoolインスタンスを作成してください。

source: Instead, use the value’s isNaN property.
ja: 代わりに、その値のisNaNプロパティを使ってください。

source: Instead, when you need an operation to have a specific numeric result, filter out any NaN values using the isNaN property.
ja: そうではなく、あなたがある特定の数値結果を持つ演算を必要とする場合、あらゆるNaN値をisNaN特性を使って除去してください。

source: Instead, you use await to receive values as they become available.
ja: その代わりに、あなたはawaitを使って値それらをそれらが利用可能になるにつれて回収します。

source: Integer
ja: 整数

source: Integer Operators
ja: 整数演算子

source: Interpolates the given value’s textual representation into the string literal being created.
ja: 与えられた値のもつテキスト表現を、その作成されている文字列リテラルへと補間します。

source: Invalid bytes are replaced by Unicode replacement characters.
ja: 無効なバイトは、ユニコード代替文字で置き換えられます。

source: Invokes the given closure with a C va_list argument derived from the given array of arguments.
ja: 与えられたクロージャを、その与えられた引数の配列から引き出されたC va_list引数で発動します。

source: Invokes the given closure with a buffer pointer covering the raw bytes of the given argument.
ja: 与えられたクロージャを、与えられた引数の生のバイトを変換しているバッファポインタとともに発動します。

source: Invokes the given closure with a mutable buffer pointer covering the raw bytes of the given argument.
ja: 与えられたクロージャを、与えられた引数の生のバイトを変換している可変バッファポインタとともに発動します。

source: Invokes the given closure with a pointer to the given argument.
ja: 与えられたクロージャを、与えられた引数に対するポインタとともに発動します。

source: It acts as an iterator by using a collection’s indices to step over each value in the collection.
ja: それは、コレクションのインデックスを使ってコレクションの中の各値のすべてを渡っていくあるイテレータとしての役割を果たします。

source: It also means that when you share a class instance across your app, changes you make to that instance are visible to every part of your code that holds a reference to that instance.
ja: それはまた、あなたがあるクラスインスタンスをあなたのアプリの至る所で共有する場合、あなたがそのインスタンスになす変更は、そのインスタンスに対する参照を保持するあなたのコードのあらゆる部分で見ることができます。

source: It is called by the compiler to handle dictionary literals.
ja: それは、辞書リテラルを取り扱うためにコンパイラによって呼ばれます。

source: It is not intended to be used from multiple concurrent contexts.
ja: それは複数の並行性文脈から使われることを意図されません。

source: It is thread safe to send and finish; all calls are to the continuation are serialized, however calling this from multiple concurrent contexts could result in out of order delivery.
ja: それは、スレッド安全に送信および終了します；並行性への呼び出しそれら全てはシリアル化されます、しかしながらこれを複数の並行性文脈から呼び出すことは、順序違い配達という結果になりえます。

source: It is thread safe to send and finish; all calls to the continuation are serialized, however calling this from multiple concurrent contexts could result in out of order delivery.
ja: それは、スレッド安全に送信および終了します；並行性への呼び出しそれら全てはシリアル化されます、しかしながらこれを複数の並行性文脈から呼び出すことは、順序違い配達という結果になりえます。

source: It is undefined behavior for the escapable closure to be stored, referenced, or executed after the function returns.
ja: 関数が返った後に格納、参照、または実行されることは、脱出可能クロージャにとって未定義挙動です。

source: It is undefined behavior to attempt to mutate through the pointer by conversion to UnsafeMutableRawBufferPointer or any other mutable pointer type.
ja: ポインタを通してUnsafeMutableRawBufferPointerまたは何か他の可変ポインタ型への変換によって変化させようと試みることは、未定義挙動です。

source: It is undefined behavior to try to mutate through the pointer argument by converting it to UnsafeMutablePointer or any other mutable pointer type.
ja: ポインタ引数を通して変化させることを、それをUnsafeMutablePointerまたは何か他の可変ポインタ型へ変換することによって、試みるのは未定義挙動です。

source: It is up to both the conformer and the receiver of the protocol to document the nature of the identity.
ja: その同一性の本質を文書化するのは、そのプロトコルの準拠側とレシーバの両方の責任です。

source: It is used by the compiler when interpreting string interpolations.
ja: それは文字列補間を解釈する時にコンパイラによって使われます。

source: It is used by the compiler when you create a string using string interpolation.
ja: それはあなたが文字列補間を使って文字列を作成する時にコンパイラによって使われます。

source: It is used by the compiler when you use a Boolean literal.
ja: それは、あなたがブールリテラルを使う時にコンパイラによって使われます。

source: It is used by the compiler when you use a string literal to initialize a Character instance.
ja: それは、あなたが文字列リテラルを使ってCharacterインスタンスを初期化する時にコンパイラによって使われます。

source: It is used by the compiler when you use an array literal.
ja: それは、あなたが配列リテラルを使う時にコンパイラによって使われます。

source: It's a good idea for all your custom model types to conform.
ja: あなたのあつらえのモデル型すべてにとって準拠することは良い考えです。

source: It's appropriate to use a class in this case, but be sure to limit which parts of your app get access to the shared database object.
ja: この場合にはクラスを使うのが適切です、しかしあなたのアプリのどの部分が共有データベースオブジェクトに対するアクセスを手に入れるかに限界を設けることを確実にしてください。

source: It's useful for communicating changes between logically separated parts of your app—such as between models and views.
ja: それは、あなたのアプリの論理的に分離された部分の間で変更を伝えるために役立ちます — 例えばモデルとビューの間など。

source: Iterating Over a Collection's Elements
ja: コレクションの要素すべてに反復していく

source: Iterating Over a Range's Elements
ja: ある範囲の持つ要素すべてに反復していく

source: Iterating Over an Array's Elements
ja: 配列の要素すべてに反復する

source: Iterating Over the Contents of a Dictionary
ja: 辞書の内容すべてにわたって反復していく

source: Iterating over Keys and Values
ja: キーと値のすべてに反復する

source: Iterating over a dictionary yields the key-value pairs as two-element tuples.
ja: ある辞書すべてを対象として反復することは、キー値ペアを２要素タプルとして生成します。

source: Iterating over the elements of a collection by their positions yields the same elements in the same order as iterating over that collection using its iterator.
ja: あるコレクションの要素すべてにそれの位置によって反復していくことは、そのコレクションすべてにそれのイテレータを使って反復していくのと同じ要素を同じ順序で生み出します。

source: It’s used by the compiler when you create a string using string interpolation.
ja: それは、あなたが文字列を文字列補完を使って作成する時に、コンパイラによって使われます。

source: Key Paths
ja: キーパス

source: Key-Path Expressions
ja: キーパス式

source: Key-value observing is a Cocoa programming pattern you use to notify objects about changes to properties of other objects.
ja: キー値監視は、他のオブジェクトのプロパティに対する変更を通知するためにあなたが使うCocoaプログラミングパターンです。

source: Language Interoperability
ja: 言語互換性

source: Learn Swift
ja: Swiftを学ぶ

source: Learn how Cocoa error parameters are converted to Swift throwing methods.
ja: CocoaエラーパラメータがSwiftスローメソッドに変換される方法を学んでください。

source: Learn how Swift represents imported C structures and unions, including types with bitfields and unnamed fields.
ja: SwiftがインポートされたC構造体と共用体を表す方法を、ビットフィールドおよび無名フィールドを持つ型を含めて、学びます。

source: Learn how functions and methods that take a completion handler are converted to Swift asynchronous functions.
ja: 完了ハンドラをとる関数およびメソッドがどのようにSwift非同期関数へと変換されるかを学んでください。

source: Learn how imported Objective-C protocol-qualified classes and metaclasses are represented.
ja: インポートされたObjective-Cプロトコル適応のクラスおよびメタクラスが表される方法を学びます。

source: Learn how to call imported functions that are declared in a C header.
ja: Cヘッダにおいて宣言されるインポートされた関数を呼び出す方法を学びます。

source: Learn the recommended steps to migrate your code.
ja: あなたのコードを移行するための推奨される段階を学んでください。

source: Like the standard IteratorProtocol, the AsyncIteratorProtocol defines a single next() method to produce elements.
ja: 標準的なIteratorProtocolのように、AsyncIteratorProtocolはただ１つのnext()メソッドだけを定義して要素それらを生み出します。

source: Likewise, if distance < 0, a limit that is greater than i has no effect.
ja: 同様に、distance < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if n < 0, a limit that is greater than i has no effect.
ja: 同様に、n < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if distance < 0, limit has no effect if it is greater than i.
ja: 同様に、distance < 0ならば、limitはそれがiより大きいならば効果を持ちません。

source: Likewise, if distance < 0, limit should be less than i to have any effect.
ja: 同様に、distance < 0ならば、limitが何らかの効果を持つにはiより少なくなければなりません。

source: Likewise, if you pass a zero-length collection as the newElements parameter, this method removes the elements in the given subrange without replacement.
ja: 同様に、あなたがゼロ長コレクションをnewElementsパラメータとして渡すならば、このメソッドは与えられた下位範囲の中の要素を置き換えることなく削除します。

source: Local changes to model types like PenPalRecord are useful.
ja: PenPalRecordのようなモデル型に対するローカルな変更は、役に立ちます。

source: Long-term storage of ArraySlice instances is discouraged.
ja: ArraySliceインスタンスの長期ストレージは推奨されません。

source: Long-term storage of a slice may therefore prolong the lifetime of elements that are no longer otherwise accessible, which can appear to be memory and object leakage.
ja: あるスライスの長期ストレージは、もはやそれ以外ではアクセス可能ではない要素の寿命を延長し、それはメモリとオブジェクトの漏洩であるように見ることができます。

source: Lowercase characters change when converted to uppercase, but not when converted to lowercase.
ja: ローワーケース文字は、アッパーケースへ変換される時は変化します、しかしローワーケースに変換される時はそうではありません。

source: MLShapedArrayProtocol Implementations
ja: MLShapedArrayプロトコル実装

source: Macros are imported when they use literals for string, floating-point, or integer values, or use operators like +, -, >, and == between literals or previously defined macros.
ja: マクロは、それらがリテラルを文字列に対して使う、または+、-、>、そして==のような演算子をリテラルや以前に定義されたマクロの間で使う場合にインポートされます。

source: Maintaining State in Your Apps
ja: あなたのアプリの状態を保守する

source: Make your custom types easier to use by ensuring that they conform to Swift protocols.
ja: あなたのカスタム型を、それらがSwiftプロトコルに準拠するのを確実にすることで、より簡単に使えるようにします。

source: Make your data types encodable and decodable for compatibility with external representations such as JSON.
ja: あなたのデータ型のエンコーディングとデコーディングを外部表現、例えばJSONなどとの互換性のために行います。

source: Managed Buffers
ja: バッファ管理

source: Managing a Shared Resource Using a Singleton
ja: 共有されるリソースをシングルトンを使って管理する

source: Manipulating Indices
ja: インデックスを操る

source: Manual Memory Management
ja: 手動メモリ管理

source: Many individual characters, such as “é”, “김”, and “🇮🇳”, can be made up of multiple Unicode scalar values.
ja: 多くの単一の文字、例えば「é」、「김」、そして「🇮🇳」などが、複数のユニコードスカラー値から構成されます。

source: Many other types are renamed or nested to clarify relationships.
ja: 多くの他の型は、改名または入れ子にされて、関係がはっきりします。

source: Many standard library types are both equatable and hashable, including strings, integers, floating-point values, Boolean values, and collections of equatable and hashable types.
ja: 多くの標準ライブラリ型は、文字列、整数、浮動点小数値、ブール値、そしてequatableとhashable型のコレクション型を含めて、equatableとhashableの両方です。

source: Many types in the standard library already conform to the Comparable protocol.
ja: 標準ライブラリの多くの型はすでにComparableプロトコルに準拠します。

source: Many types in the standard library conform to Hashable: Strings, integers, floating-point and Boolean values, and even sets are hashable by default.
ja: 標準ライブラリの中の多くの型はHashableに準拠します：様々な文字列、整数、浮動小数点およびブール値、そして様々な集合さえも、初期状態でハッシュ可能です。

source: Many value types in Swift bridge to Objective-C counterparts, like String and Int.
ja: Swiftでの多くの値型は、Objective-Cの相当物へとブリッジします、StringやIntのように。

source: Mark properties that you want to observe through key-value observing with both the @objc attribute and the dynamic modifier.
ja: あなたがキー値監視を通して監視したいプロパティを@objc属性とdynamic修飾子の両方で印してください。

source: Masked Arithmetic
ja: 隠された算術

source: Memory Access
ja: メモリアクセス

source: Merges the given dictionary into this dictionary, using a combining closure to determine the value for any duplicate keys.
ja: 与えられた辞書をこの辞書へと結合します、結合用のクロージャを使って何らかの重複キーに対して値を決定します。

source: Merges the key-value pairs in the given sequence into the dictionary, using a combining closure to determine the value for any duplicate keys.
ja: 与えられたシーケンスの中のキー値ペアをこの辞書へと結合します、結合用のクロージャを使って何らかの重複キーに対して値を決定します。

source: Methods and properties that are marked with the internal modifier and declared within a class that inherits from an Objective-C class are accessible to the Objective-C runtime.
ja: internal修飾子で印されたそしてObjective-Cクラスから継承するクラス内部で宣言されたメソッドとプロパティは、Objective-Cランタイムからアクセス可能です。

source: Methods that return another AsyncSequence return a type specific to the method’s semantics.
ja: もう１つのAsyncSequenceを返すメソッドそれらは、メソッドのもつ意味論に特有のひとつの型を返します。

source: Methods whose completion handlers populate a NSError pointer parameter also become throwing methods in Swift, as described in About Imported Cocoa Error Parameters.
ja: それの持つ完了ハンドラにNSErrorポインタパラメータが入っているメソッドはまた、Swiftではスローするメソッドになります、インポートされるCocoaエラーパラメータについてで記述されるように。

source: Methods whose completion handlers take multiple arguments become methods that return a tuple.
ja: それの完了ハンドラが複数の引数をとるメソッドは、あるタプルを返すメソッドになります。

source: Migrating Your Objective-C Code to Swift
ja: あなたのObjective-Cコードのスウィフトへの移行

source: Modifying Copies of Arrays
ja: 配列のコピーを修正する

source: Moreover, Swift structures can adopt protocols to gain behavior through default implementations.
ja: その上さらに、Swift構造体はプロトコルを採用することで、省略時の実装を通して挙動を獲得できます。

source: Moreover, a collection’s indices form a finite range of the positions of the collection’s elements.
ja: その上、コレクションのインデックスは、コレクションの要素の位置からなる有限の範囲を形成します。

source: Moreover, inequality is the inverse of equality, so any custom implementation of the != operator must guarantee that a != b implies !(a == b).
ja: その上に、不等性は同等性の逆です、それで!=演算子のあらゆるあつらえの実装は、a != bが!(a == b)を意味することを保証しなければなりません。

source: Most StringInterpolation types will store information about the literals and interpolations appended to them in one or more properties.
ja: ほとんどのStringInterpolation型は、それらに加えられたリテラルと補間についての情報を１つ以上のプロパティにおいて格納します。

source: Most basic types in the Swift standard library conform to Equatable.
ja: Swift標準ライブラリの基本的な型のほとんどはEquatableに準拠します。

source: Most collections in the standard library use IndexingIterator as their iterator.
ja: 標準ライブラリの中のほとんどのコレクションは、IndexingIteratorをそれらのイテレータとして使います。

source: Most operations with a NaN operand produce a NaN result.
ja: NaN演算数を使うほとんどの演算は、結果NaNを生成します。

source: Multiple copies of an array share the same storage until you modify one of the copies.
ja: ある配列の複数のコピーは、あなたがコピーの１つを修正するまでは、同じストレージを共有します。

source: Multiplies two values and produces their product, rounding to a representable value.
ja: ２つの値を乗算してそれらの積を生成します、表現可能な値へ丸められます。

source: Multiplies two values and produces their product.
ja: ２つの値を乗算してそれらの積を生成します。

source: Multiplies two values and stores the result in the left-hand-side variable, rounding to a representable value.
ja: ２つの値を乗算して、結果を左手側の変数に格納します、表現可能な値へ丸められます。

source: Multiplies two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を乗算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Multiplies two values and stores the result in the left-hand-side variable.
ja: ２つの値を乗算して、結果を左手側の変数に格納します。

source: Must be finite.
ja: 有限でなければなりません。

source: Must never be called, since this collection is always empty.
ja: 決して呼ばないでください、このコレクションは常に空であるからです。

source: NaN (“not a number”)
ja: NaN（「非数」）

source: NaN is not equal to any value, including itself.
ja: NaNは、それ自身を含めてあらゆる値と等しくありません。

source: NaN propagates through many arithmetic operations.
ja: NaNは、いくつもの算術演算をずっと伝播していきます。

source: NaN values compare not equal to every value, including themselves.
ja: NaNは、それら自身を含めてあらゆる値に対して等しくないと比較されます。

source: Negation
ja: 負にする

source: Negative values are returned in two’s complement representation, regardless of the type’s underlying implementation.
ja: 負の値が、２の補数表現において返されます、その型のもつ基礎となる実装に関係なく。

source: Neither the firstHalf nor secondHalf slices allocate any new storage of their own.
ja: firstHalfおよびsecondHalfスライスのどちらも、なんらそれら独自の新規ストレージを割り当てません。

source: Never call finalize() on hasher.
ja: finalize()をhasher上で決して呼び出さないでください。

source: Never resuming leaves the task in a suspended state indefinitely, and leaks any associated resources.
ja: 再開することは、そのタスクを決して曖昧に中断状態のままにしておきません、そしていかなる関連したリソースも漏洩しません。

source: Next, implement the == operator function, the requirement inherited from the Equatable protocol.
ja: 次に、==演算子関数、Equatableプロトコルから継承される要件を実装してください。

source: Next, the observations in Celsius are converted to Fahrenheit:
ja: 次に、摂氏での観測は華氏に変換されます：

source: No further bridging is required when accessing elements of the Array instance.
ja: さらなるブリッジはArrayインスタンスの要素にアクセスするとき全く必要とされません。

source: None
ja: なし
